>1.Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

Expected Output:

Number of attempts in the examination is greater than 2:

name score attempts qualify

b Dima 9.0 3 no

d James NaN 3 no

f Michael 20.0 3 yes

In [1]:
import pandas as pd
import numpy as np

In [17]:
data={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas','Michael'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19,1],
        'attempts' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1,1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes','no']}

index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j','z']

In [18]:
df=pd.DataFrame(data,index=index)

In [19]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
z    Michael    1.0         1      no

In [20]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

>2.Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [21]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

>3.Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [22]:
df.sort_values(by=['name','score'],ascending=[False,True])

        name  score  attempts qualify
z    Michael    1.0         1      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

>

Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.

In [23]:
d = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print("Original Orders DataFrame:")

Original Orders DataFrame:

In [24]:
d

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3001         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3005         5001
3    70004     110.50  2012-08-17         3001         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3001         5001
6    70008    5760.00  2012-09-10         3005         5001
7    70010    1983.43  2012-10-10         3001         5006
8    70003    2480.40  2012-10-10         3005         5003
9    70012     250.45  2012-06-27         3001         5002
10   70011      75.29  2012-08-17         3005         5007
11   70013    3045.60  2012-04-25         3005         5001

In [41]:
newd=d.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum})

In [42]:
newd['purch_amt']

customer_id  salesman_id
3001         5001           2400.60
             5002            400.95
             5003            110.50
             5005            270.65
             5006           1983.43
3005         5001           8870.86
             5002            948.50
             5003           2480.40
             5007             75.29
Name: purch_amt, dtype: float64

In [43]:
result=newd['purch_amt'].groupby(level=0, group_keys=False)

In [44]:
result.nlargest()

customer_id  salesman_id
3001         5001           2400.60
             5006           1983.43
             5002            400.95
             5005            270.65
             5003            110.50
3005         5001           8870.86
             5003           2480.40
             5002            948.50
             5007             75.29
Name: purch_amt, dtype: float64